{
  "version": "https://jsonfeed.org/version/1",
  "title": "Nathan's Blog",
  "home_page_url": "https://nathanielwheeler.com",
  "description": "A blog about code and whatever I feel like.",
  "author": {
    "name": "Nathaniel Wheeler"
  },
  "items": [
    {
      "id": "",
      "url": "https://nathanielwheeler.com/blog/2020/blogtober-01",
      "title": "Blogtober Day 1: Developing an App",
      "summary": "\u003cp\u003eBlogtober is a month-long challenge to publish a blog post every day for the month of October.  When I realized this event was coming up, I knew that I had to commit for my fresh new blog.\u003c/p\u003e\n\u003cp\u003eSo, for every day of October, I will be writing about the development of my latest project: implementing the \u003ca href=\"https://www.thethemesystem.com/\"\u003eTheme System\u003c/a\u003e as a web application.\u003c/p\u003e\n\u003cp\u003eWhat is the Theme System?  Instead of setting a yearly resolution into stone and giving up because you missed that one day, you can instead pick out a 'theme' for the year (or a season) that guides your endeavors.\u003c/p\u003e\n\u003cp\u003eFor example, both of the creators have used the theme 'Year of Less', which translated to a year of less travel and fewer commitments for one, and no new projects for the other.\u003c/p\u003e\n\u003cdiv class=\"collapse multi-collapse show\" id=\"explanationButton\"\u003e\n\u003cbutton class=\"btn btn-outline-primary btn-block\" type=\"button\" data-toggle=\"collapse\" data-target=\".multi-collapse\" aria-expanded=\"false\" aria-controls=\"explanationButton themeSystemExplained\"\u003e\n\tClick here for a more lengthy explanation.\n\u003c/button\u003e\n\u003cbr\u003e\n\u003c/div\u003e\n\u003cdiv class=\"collapse multi-collapse\" id=\"themeSystemExplained\"\u003e\n\u003cdiv class=\"embed-responsive embed-responsive-16by9\"\u003e\u003ciframe class=\"embed-responsive-item\" src=\"https://www.youtube.com/embed/NVGuFdX5guE\" frameborder=\"0\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen\u003e\u003c/iframe\u003e\u003c/div\u003e\n\u003cdiv class=\"text-center\"\u003e\u003cem\u003e\u003cstrong\u003eCo-creator CGP Grey explains the Theme System \u003c/strong\u003e\u003ca href=\".multi-collapse\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"explanationButton themeSystemExplained\"\u003e(hide)\u003c/a\u003e\u003c/em\u003e\u003c/div\u003e\u003cbr\u003e\n\u003c/div\u003e\n\u003cp\u003eImplementing this system as a web application is something I have pondered ever since I heard of it last year.  I've been putting it off either because I believed I didn't have the skills or because life was too crazy to start a new project.  But now, I'm at a spot in life where I believe I can reasonably get this done.\u003c/p\u003e\n\u003cp\u003eTomorrow, I'll start prototyping the website.\u003c/p\u003e\n\u003ch3\u003eInktober: Day 1\u003c/h3\u003e\n\u003cp\u003eNot only is it Blogtober, it is Inktober, where you make an ink drawing for every day of October!  I've started with something simple: the \u003ca href=\"https://blog.golang.org/gopher\"\u003eGo gopher!\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg class=\"card-img-top\" src=\"/images/posts/inktober20-01.jpeg\" alt=\"The Go gopher on a beanbag chair typing on a keyboard whilst sweating profusely.\"\u003e\u003cbr\u003e\u003c/p\u003e\n\u003cp\u003eNot a good ink wash, but it leaves room to improve.  Tomorrow, I'm going to track down my technical pens and do some \u003cem\u003ecrosshatching!\u003c/em\u003e\u003c/p\u003e\n",
      "date_published": "2020-10-01T20:28:22.433705-06:00"
    },
    {
      "id": "",
      "url": "https://nathanielwheeler.com/blog/2020/whats-next",
      "title": "What's Next?",
      "summary": "\u003cp\u003eNow that I have a blog in production, I've been asking myself what I should focus on for my next project.\u003c/p\u003e\n\u003cp\u003eWhile I am eager to get started on something new, I still have a lot of features I want to add to this blog before I focus my coding elsewhere.  Here's what's at the top of my list, in no particular order:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA comment system for blog posts\u003c/li\u003e\n\u003cli\u003eEmail verification for new accounts, as well as password resets.\u003c/li\u003e\n\u003cli\u003eSign in with google or some other account verifier\u003c/li\u003e\n\u003cli\u003eAn RSS Feed\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eI'm still considering what to do after I've finished polishing this website.  I'd like to experiment with javascript frontends for a go backend.  I'd also like to make journaling app inspired by the \u003ca href=\"https://www.thethemesystem.com/\"\u003eTheme System\u003c/a\u003e.\u003c/p\u003e\n",
      "date_published": "2020-09-23T13:28:19.819285-06:00"
    },
    {
      "id": "",
      "url": "https://nathanielwheeler.com/blog/2020/newblog",
      "title": "New Blog!",
      "summary": "\u003cp\u003eHello the internet!  Welcome to the blog of me, Nathaniel Wheeler.\u003c/p\u003e\n\u003cp\u003eWhat is this blog for?  I'm glad you asked.  This is a blog for \u003cem\u003ewhatever happens to hold my interest at the time of writing.\u003c/em\u003e  This could, potentially, be many things, but let's not initialize our chickens before they're defined, am I right?\u003c/p\u003e\n\u003cp\u003eNow, this blog was \u003cem\u003esupposed\u003c/em\u003e to be live way back in February.  Back in December of '19, I had just recently spent three months in an intense code camp learning C# and Javascript web frameworks.  I thought that I could learn another new language by myself in a similar length of time.\u003c/p\u003e\n\u003cp\u003eNeedless to say, February came and went with no website to show for it.  And since March, I've moved towns, gone back to school, and learned what a pandemic is.  It might just be me, but I feel like this year has been a bit crazy!\u003c/p\u003e\n\u003cp\u003eProbably just me though.\u003c/p\u003e\n",
      "date_published": "2020-09-15T12:54:37.182019-06:00"
    }
  ]
}